Documents/ГрафикИсполненияДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ГрафикИсполненияДоговора</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыСКлиентамиПланОплат</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщикамиПланПоставок</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКлиентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКлиентамиПланОтгрузок</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщикамиПланОплат</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКлиентамиПоДокументам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокРасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикЧастичноИсполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭтапыГрафикаИсполненияДоговора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПоГрафику</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИсполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИсполнения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УжеОтгружено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыГрафикаОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыКонтроляОплатыКлиентом</v8:Type>
								<v8:Type>cfg:EnumRef.ВариантыКонтроляОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтсчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОтсчетаДатыПлатежа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сдвиг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УжеОплачено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФормулыРасчетаДатыПлатежа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВариантыОтсчетаДатыПлатежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыОтсчетаДатыПлатежа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтДатыЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтДатыСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоДатыОтгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтДатыОтгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтДатыПереходаПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнаяДата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтДатыПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Формула</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыОпределенияГрафикаИсполненияВДоговоре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыОпределенияГрафикаИсполненияВДоговоре</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказыНакладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегулярныеПлатежи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ГрафикИсполненияДоговора/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрыГрафика = Новый Структура;
	ПараметрыГрафика.Вставить("Договор", Объект.Договор);
	ПараметрыГрафика.Вставить("СуммаДоговора", СуммаДоговора);
	
	Оповестить("Запись_ГрафикИсполненияДоговора", ПараметрыГрафика, Объект.Ссылка);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СуммаДоговораПриИзменении(Элемент)
	
	ПересчитатьПроценты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДлительностьДоставкиПриИзменении(Элемент)
	
	Если Объект.ДлительностьДоставки = 0 Тогда
		Для Каждого СтрокаИсполнения Из Объект.ЭтапыГрафикаИсполненияДоговора Цикл
			СтрокаИсполнения.ДатаПоГрафику =  СтрокаИсполнения.ДатаОтгрузки;
		КонецЦикла;
	КонецЕсли;
	
	ПерезаполнитьДатыПоГрафикуИДатыПлатежа();
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимУчетаОтсрочкиПриИзменении(Элемент)
	
	РежимУчетаОтсрочкиПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПриИзменении(Элемент)
	
	ПерезаполнитьДатыПоГрафикуИДатыПлатежа();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикЧастичноИсполненПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
	Если Не Объект.ГрафикЧастичноИсполнен Тогда
		Для Каждого СтрокаЭтапа Из Объект.ЭтапыГрафикаИсполненияДоговора Цикл
			СтрокаЭтапа.УжеОтгружено = Ложь;
		КонецЦикла;
		Для Каждого СтрокаЭтапа Из Объект.ЭтапыГрафикаОплаты Цикл
			СтрокаЭтапа.УжеОплачено = Ложь;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭтапыГрафикаИсполненияДоговора

&НаКлиенте
Процедура ЭтапыГрафикаИсполненияДоговораПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущиеДанные = Элементы.ЭтапыГрафикаИсполненияДоговора.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено
		И НЕ ОтменаРедактирования
		И ВТаблицеЭтаповЕстьЭтапыОтДатыОтгрузки()
		И Объект.ЭтапыГрафикаОплаты.Количество() > 0
		И (ТипЗнч(РедактируемаяСтрока) = Тип("Структура")
				И (РедактируемаяСтрока.ПроцентИсполнения <> ТекущиеДанные.ПроцентИсполнения
					ИЛИ РедактируемаяСтрока.СуммаИсполнения <> ТекущиеДанные.СуммаИсполнения
					ИЛИ РедактируемаяСтрока.ДатаПоГрафику <> ТекущиеДанные.ДатаПоГрафику) 
			ИЛИ НоваяСтрока 
				И (ЗначениеЗаполнено(ТекущиеДанные.ДатаПоГрафику) 
					ИЛИ ЗначениеЗаполнено(ТекущиеДанные.ПроцентИсполнения)
					ИЛИ ЗначениеЗаполнено(ТекущиеДанные.СуммаИсполнения))) Тогда
				
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("СтрокаЭтапа",Элементы.ЭтапыГрафикаИсполненияДоговора.ТекущаяСтрока);
		ДополнительныеПараметры.Вставить("ДатаПоГрафику", ТекущиеДанные.ДатаПоГрафику);
		ДополнительныеПараметры.Вставить("СуммаИсполнения",ТекущиеДанные.СуммаИсполнения);
		ДополнительныеПараметры.Вставить("ПроцентИсполнения",ТекущиеДанные.ПроцентИсполнения);
		
		ТекстВопроса = НСтр("ru = 'График оплаты будет очищен, продолжить?'");
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ЭтапыГрафикаИсполненияДоговораПриОкончанииРедактированияЗавершение", ЭтотОбъект, ДополнительныеПараметры), 
				ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		СвернутьЭтапыИсполнения();
		СортироватьЭтапыИсполнения();
		РассчитатьИтоговыеПоказатели(ЭтотОбъект);
		
	КонецЕсли;
	
	УстановитьЗаголовкиГрафикЧастичноИсполнен();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаИсполненияДоговораПриОкончанииРедактированияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		СтрокаЭтапа = Объект.ЭтапыГрафикаИсполненияДоговора.НайтиПоИдентификатору(ДополнительныеПараметры.СтрокаЭтапа);
		Если РедактируемаяСтрока = Неопределено Тогда
			Объект.ЭтапыГрафикаИсполненияДоговора.Удалить(СтрокаЭтапа);
		Иначе
			СтрокаЭтапа.ПроцентИсполнения = РедактируемаяСтрока.ПроцентИсполнения;
			СтрокаЭтапа.СуммаИсполнения = РедактируемаяСтрока.СуммаИсполнения;
			СтрокаЭтапа.ДатаПоГрафику = РедактируемаяСтрока.ДатаПоГрафику;
			СтрокаЭтапа.ДатаОтгрузки = СтрокаЭтапа.ДатаПоГрафику - 86400 * Объект.ДлительностьДоставки;
		КонецЕсли;
		
		СвернутьЭтапыИсполнения();
		СортироватьЭтапыИсполнения();
		РассчитатьИтоговыеПоказатели(ЭтотОбъект);
		
	Иначе
		Объект.ЭтапыГрафикаОплаты.Очистить();
		РассчитатьИтоговыеПоказатели(ЭтотОбъект);
		УстановитьВидимостьЭлементов();
		УстановитьЗаголовкиГрафикЧастичноИсполнен();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаИсполненияДоговораПроцентИсполненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыГрафикаИсполненияДоговора.ТекущиеДанные;
	
	Если ТекущиеДанные.ПроцентИсполнения > 0 И Объект.ЭтапыГрафикаИсполненияДоговора.Итог("ПроцентИсполнения") = 100 Тогда
		
		СуммаИсполнения = 0;
		Для Каждого ТекСтрока Из Объект.ЭтапыГрафикаИсполненияДоговора Цикл
			Если ТекСтрока.НомерСтроки <> ТекущиеДанные.НомерСтроки Тогда
				СуммаИсполнения = СуммаИсполнения + ТекСтрока.СуммаИсполнения;
			КонецЕсли;
		КонецЦикла;
		ТекущиеДанные.СуммаИсполнения = СуммаДоговора - СуммаИсполнения;
	Иначе
		
		ТекущиеДанные.СуммаИсполнения = СуммаДоговора * ТекущиеДанные.ПроцентИсполнения / 100;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаИсполненияДоговораСуммаИсполненияПриИзменении(Элемент)
	
	ПересчитатьПроценты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаИсполненияДоговораДатаОтгрузкиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыГрафикаИсполненияДоговора.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если ЗначениеЗаполнено(Объект.Календарь) Тогда
			ТекущиеДанные.ДатаПоГрафику = ДатаПоступленияПоКалендарю(ТекущиеДанные.ДатаОтгрузки);
		Иначе
			ТекущиеДанные.ДатаПоГрафику = ТекущиеДанные.ДатаОтгрузки + 86400 * Объект.ДлительностьДоставки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаИсполненияДоговораДатаПоГрафикуПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыГрафикаИсполненияДоговора.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если ЗначениеЗаполнено(Объект.Календарь) Тогда
			ТекущиеДанные.ДатаОтгрузки = ДатаПоступленияПоКалендарю(ТекущиеДанные.ДатаПоГрафику,Истина);
		Иначе
			ТекущиеДанные.ДатаОтгрузки = ТекущиеДанные.ДатаПоГрафику - 86400 * Объект.ДлительностьДоставки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаИсполненияДоговораПередУдалением(Элемент, Отказ)
	
	Если ВТаблицеЭтаповЕстьЭтапыОтДатыОтгрузки() Тогда
		
		Отказ = Истина;
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("СтрокаЭтапа",Элементы.ЭтапыГрафикаИсполненияДоговора.ТекущаяСтрока);
		
		ТекстВопроса = НСтр("ru = 'График оплаты будет очищен, продолжить?'");
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ЭтапыГрафикаИсполненияДоговораПередУдалениемЗавершение", ЭтотОбъект, ДополнительныеПараметры), 
				ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаИсполненияДоговораПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ЭтапыГрафикаИсполненияДоговора.ТекущиеДанные;
	
	РедактируемаяСтрока = Новый Структура;
	РедактируемаяСтрока.Вставить("ДатаПоГрафику", ТекущиеДанные.ДатаПоГрафику);
	РедактируемаяСтрока.Вставить("ПроцентИсполнения", ТекущиеДанные.ПроцентИсполнения);
	РедактируемаяСтрока.Вставить("СуммаИсполнения", ТекущиеДанные.СуммаИсполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаИсполненияДоговораПослеУдаления(Элемент)
	СвернутьЭтапыИсполнения();
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаИсполненияДоговораПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекущиеДанные = Элементы.ЭтапыГрафикаИсполненияДоговора.ТекущиеДанные;
	Если НоваяСтрока И НЕ ОтменаРедактирования Тогда
		
		ОчиститьСообщения();
		
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ДатаПоГрафику) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Заполните дату отгрузки'"),
				Объект.Ссылка,
				"Объект.ЭтапыГрафикаИсполненияДоговора",,Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.СуммаИсполнения) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Заполните сумму отгрузки'"),
				Объект.Ссылка,
				"Объект.ЭтапыГрафикаИсполненияДоговора",,Отказ);
		КонецЕсли;
		
	КонецЕсли;
	Если Не ОтменаРедактирования Тогда
		УстановитьЗаголовкиГрафикЧастичноИсполнен();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭтапыГрафикаОплаты

&НаКлиенте
Процедура ЭтапыГрафикаОплатыСдвигПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыГрафикаОплаты.ТекущиеДанные;
	
	ПараметрыЗаполненияДатыПлатежа = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
	ПараметрыЗаполненияДатыПлатежа.ДатаЗаказа                     = ДатаДоговора;
	ПараметрыЗаполненияДатыПлатежа.ДатаСогласования               = ДатаДоговора;
	ПараметрыЗаполненияДатыПлатежа.ДатаОтгрузки                   = ТекущиеДанные.ДатаОтгрузки;
	Если ЗначениеЗаполнено(Объект.Календарь) Тогда
		ПараметрыЗаполненияДатыПлатежа.ДатаПоступления                = ДатаПоступленияПоКалендарю(ТекущиеДанные.ДатаОтгрузки);
	Иначе
		ПараметрыЗаполненияДатыПлатежа.ДатаПоступления                = ТекущиеДанные.ДатаОтгрузки+Объект.ДлительностьДоставки*86400;
	КонецЕсли;
	ПараметрыЗаполненияДатыПлатежа.ДатаПереходаПраваСобственности = Дата(1,1,1);
	ПараметрыЗаполненияДатыПлатежа.СрокПереходаПраваСобственности = Объект.ДлительностьДоставки;
	ПараметрыЗаполненияДатыПлатежа.Календарь                      = Объект.Календарь;
	
	ЭтапыОплатыКлиент.ЭтапыГрафикаОплатыСдвигВариантОтсчетаПриИзменении(
		ТекущиеДанные,ПараметрыЗаполненияДатыПлатежа);
	
	СортироватьЭтапыОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаОплатыВариантОтсчетаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыГрафикаОплаты.ТекущиеДанные;
	
	Если ТекущиеДанные.ВариантОтсчета = ПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.ФиксированнаяДата") Тогда
		ТекущиеДанные.Сдвиг = 0;
	КонецЕсли;
	
	Если ТекущиеДанные.ВариантОтсчета = ПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.Формула") Тогда
		ОбработкаВыбора = Новый ОписаниеОповещения("ЭтапыОплатыВариантОтсчетаПриИзмененииЗавершение",ЭтотОбъект);
		ОткрытьФорму("Справочник.ФормулыРасчетаДатыПлатежа.Форма.ФормаВыбора",,ЭтотОбъект,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ТекущиеДанные.Формула = Неопределено;
		ВыполнитьРасчетДатыПлатежаПриИзмененииВариантаОтсчета();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОплатыВариантОтсчетаПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = Элементы.ЭтапыГрафикаОплаты.ТекущиеДанные;
	
	Если Результат = Неопределено Тогда
		ТекущиеДанные.ВариантОтсчета = Неопределено;
		ТекущиеДанные.Формула = Неопределено;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Формула = Результат;
	
	ВыполнитьРасчетДатыПлатежаПриИзмененииВариантаОтсчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРасчетДатыПлатежаПриИзмененииВариантаОтсчета()
	
	ТекущиеДанные = Элементы.ЭтапыГрафикаОплаты.ТекущиеДанные;
	
	ТекущиеДанные.ДатаОтгрузки = ДатаОтгрузкиПоУмолчанию(ТекущиеДанные.ВариантОтсчета, ТекущиеДанные.Формула);
	
	ПараметрыЗаполненияДатыПлатежа = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
	ПараметрыЗаполненияДатыПлатежа.ДатаЗаказа                     = ДатаДоговора;
	ПараметрыЗаполненияДатыПлатежа.ДатаСогласования               = ДатаДоговора;
	ПараметрыЗаполненияДатыПлатежа.ДатаОтгрузки                   = ТекущиеДанные.ДатаОтгрузки;
	Если ЗначениеЗаполнено(Объект.Календарь) Тогда
		ПараметрыЗаполненияДатыПлатежа.ДатаПоступления                = ДатаПоступленияПоКалендарю(ТекущиеДанные.ДатаОтгрузки);
	Иначе
		ПараметрыЗаполненияДатыПлатежа.ДатаПоступления                = ТекущиеДанные.ДатаОтгрузки+Объект.ДлительностьДоставки*86400;
	КонецЕсли;
	ПараметрыЗаполненияДатыПлатежа.ДатаПереходаПраваСобственности = Дата(1,1,1);
	ПараметрыЗаполненияДатыПлатежа.СрокПереходаПраваСобственности = Объект.ДлительностьДоставки;
	ПараметрыЗаполненияДатыПлатежа.Календарь                      = Объект.Календарь;
	
	ЭтапыОплатыКлиент.ЭтапыГрафикаОплатыСдвигВариантОтсчетаПриИзменении(
		ТекущиеДанные, ПараметрыЗаполненияДатыПлатежа);
	
	СортироватьЭтапыОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаОплатыВариантОплатыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыГрафикаОплаты.ТекущиеДанные;
	
	ПараметрыЗаполненияДатыПлатежа = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
	ПараметрыЗаполненияДатыПлатежа.ДатаЗаказа                     = ДатаДоговора;
	ПараметрыЗаполненияДатыПлатежа.ДатаСогласования               = ДатаДоговора;
	ПараметрыЗаполненияДатыПлатежа.ДатаОтгрузки                   = ТекущиеДанные.ДатаОтгрузки;
	Если ЗначениеЗаполнено(Объект.Календарь) Тогда
		ПараметрыЗаполненияДатыПлатежа.ДатаПоступления                = ДатаПоступленияПоКалендарю(ТекущиеДанные.ДатаОтгрузки);
	Иначе
		ПараметрыЗаполненияДатыПлатежа.ДатаПоступления                = ТекущиеДанные.ДатаОтгрузки+Объект.ДлительностьДоставки*86400;
	КонецЕсли;
	ПараметрыЗаполненияДатыПлатежа.ДатаПереходаПраваСобственности = Дата(1,1,1);
	ПараметрыЗаполненияДатыПлатежа.СрокПереходаПраваСобственности = Объект.ДлительностьДоставки;
	ПараметрыЗаполненияДатыПлатежа.Календарь                      = Объект.Календарь;
	
	ЭтапыОплатыКлиент.ЭтапыГрафикаОплатыВариантКонтроляПриИзменении(
		ТекущиеДанные,ПараметрыЗаполненияДатыПлатежа);
	
	СортироватьЭтапыОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаОплатыПроцентОплатыПриИзменении(Элемент)
	ЭтапыОплатыКлиент.ЭтапыГрафикаОплатыПроцентПлатежаПриИзменении(
		Элементы.ЭтапыГрафикаОплаты.ТекущиеДанные,
		Объект.ЭтапыГрафикаОплаты,
		СуммаДоговора);
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаОплатыСуммаОплатыПриИзменении(Элемент)
	ЭтапыОплатыКлиент.ЭтапыГрафикаОплатыСуммаПлатежаПриИзменении(
		Элементы.ЭтапыГрафикаОплаты.ТекущиеДанные,
		Объект.ЭтапыГрафикаОплаты,
		СуммаДоговора);
	ПересчитатьПроценты(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаОплатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.ЭтапыГрафикаОплаты.ТекущиеДанные.ВариантОтсчета = ПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.ОтДатыЗаказа");
		Если ЭтоРасчетыСКлиентами Тогда
			Элементы.ЭтапыГрафикаОплаты.ТекущиеДанные.ВариантОплаты = ПредопределенноеЗначение("Перечисление.ВариантыКонтроляОплатыКлиентом.КредитСдвиг");
		Иначе
			Элементы.ЭтапыГрафикаОплаты.ТекущиеДанные.ВариантОплаты = ПредопределенноеЗначение("Перечисление.ВариантыКонтроляОплатыПоставщику.КредитСдвиг");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаОплатыДатаПоГрафикуПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыГрафикаОплаты.ТекущиеДанные;
	
	ПараметрыЗаполненияСдвига = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
	ПараметрыЗаполненияСдвига.ДатаЗаказа                     = ДатаДоговора;
	ПараметрыЗаполненияСдвига.ДатаСогласования               = ДатаДоговора;
	ПараметрыЗаполненияСдвига.ДатаОтгрузки                   = ТекущиеДанные.ДатаОтгрузки;
	Если ЗначениеЗаполнено(Объект.Календарь) Тогда
		ПараметрыЗаполненияСдвига.ДатаПоступления                = ДатаПоступленияПоКалендарю(ТекущиеДанные.ДатаОтгрузки);
	Иначе
		ПараметрыЗаполненияСдвига.ДатаПоступления                = ТекущиеДанные.ДатаОтгрузки+Объект.ДлительностьДоставки*86400;
	КонецЕсли;
	ПараметрыЗаполненияСдвига.ДатаПереходаПраваСобственности = Дата(1,1,1);
	ПараметрыЗаполненияСдвига.СрокПереходаПраваСобственности = Объект.ДлительностьДоставки;
	ПараметрыЗаполненияСдвига.Календарь                      = Объект.Календарь;
	
	ЭтапыОплатыКлиент.ЭтапыГрафикаОплатыДатаПлатежаПриИзменении(
		ТекущиеДанные,ПараметрыЗаполненияСдвига);
	
	СортироватьЭтапыОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаОплатыУжеОплаченоПриИзменении(Элемент)
	УстановитьЗаголовкиГрафикЧастичноИсполнен();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаОплатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Оповещение = Новый ОписаниеОповещения("ЭтапыГрафикаОплатыПередНачаломДобавленияЗавершение", ЭтотОбъект);
	
	ПараметрыРедактирования = ПараметрыРедактированияНесколькихЭтаповОплаты();
	
	ЭтапыОплатыКлиент.ЭтапыГрафикаОплатыПередНачаломДобавления(ЭтаФорма,
		ПараметрыРедактирования,
		Отказ,
		Копирование,
		Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаОплатыПередНачаломДобавленияЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		УстановитьВидимостьЭлементов();
		УстановитьЗаголовкиГрафикЧастичноИсполнен();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаОплатыПередУдалением(Элемент, Отказ)
	
	ЭтапыОплатыКлиент.ЭтапыГрафикаОплатыПередУдалением(ЭтаФорма, Отказ, Объект.ЭтапыГрафикаОплаты);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаОплатыПередНачаломИзменения(Элемент, Отказ)
	
	Оповещение = Новый ОписаниеОповещения("ЭтапыГрафикаОплатыПередНачаломИзмененияЗавершение", ЭтотОбъект);
	
	ПараметрыРедактирования = ПараметрыРедактированияНесколькихЭтаповОплаты();
	
	ЭтапыОплатыКлиент.ЭтапыГрафикаОплатыПередНачаломИзменения(ЭтаФорма,
		ПараметрыРедактирования,
		Отказ,
		Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаОплатыПередНачаломИзмененияЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ПересчитатьПроценты(ЭтотОбъект);
		УстановитьЗаголовкиГрафикЧастичноИсполнен();
		СортироватьЭтапыОплаты();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаОплатыПослеУдаления(Элемент)
	УстановитьВидимостьЭлементов();
	УстановитьЗаголовкиГрафикЧастичноИсполнен();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаОплатыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтотОбъект);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура ЗаполнитьГрафикОплатыПоСоглашению(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьГрафикОплатыПоСоглашениюЗавершение", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура("Контрагент",Контрагент);
	
	Если ЭтоРасчетыСКлиентами Тогда
		ОткрытьФорму("Справочник.СоглашенияСКлиентами.Форма.ФормаВыбора",ПараметрыОткрытия,ЭтотОбъект,,,,Оповещение);
	Иначе
		ОткрытьФорму("Справочник.СоглашенияСПоставщиками.Форма.ФормаВыбора",ПараметрыОткрытия,ЭтотОбъект,,,,Оповещение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор,
			"Сумма,ТипДоговора,Дата,Контрагент,ВалютаВзаиморасчетов,ВариантОпределенияГрафикаИсполненияВДоговоре");
		
		СуммаДоговора = РеквизитыДоговора.Сумма;
		ЭтоРасчетыСКлиентами =
			РеквизитыДоговора.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем
			Или Ложь;
		ДатаДоговора = РеквизитыДоговора.Дата;
		Контрагент = РеквизитыДоговора.Контрагент;
		Валюта = РеквизитыДоговора.ВалютаВзаиморасчетов;
		
		Элементы.ЭтапыГрафикаОплатыВариантОтсчета.СписокВыбора.Добавить(Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыЗаказа, НСтр("ru = 'от даты договора'"));
		Элементы.ЭтапыГрафикаОплатыВариантОтсчета.СписокВыбора.Добавить(Перечисления.ВариантыОтсчетаДатыПлатежа.ДоДатыОтгрузки);
		Элементы.ЭтапыГрафикаОплатыВариантОтсчета.СписокВыбора.Добавить(Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки);
		Если НЕ ЭтоРасчетыСКлиентами Тогда
			Элементы.ЭтапыГрафикаОплатыВариантОтсчета.СписокВыбора.Добавить(Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыПоступления);
		КонецЕсли;
		Элементы.ЭтапыГрафикаОплатыВариантОтсчета.СписокВыбора.Добавить(Перечисления.ВариантыОтсчетаДатыПлатежа.ФиксированнаяДата);
		Элементы.ЭтапыГрафикаОплатыВариантОтсчета.СписокВыбора.Добавить(Перечисления.ВариантыОтсчетаДатыПлатежа.Формула);
		
		Если ЭтоРасчетыСКлиентами Тогда
			Элементы.ЭтапыГрафикаОплатыВариантОплаты.СписокВыбора.Добавить(Перечисления.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки);
			Элементы.ЭтапыГрафикаОплатыВариантОплаты.СписокВыбора.Добавить(Перечисления.ВариантыКонтроляОплатыКлиентом.КредитСдвиг);
			Элементы.ЭтапыГрафикаОплатыВариантОплаты.СписокВыбора.Добавить(Перечисления.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки);
			
			Если ПолучитьФункциональнуюОпцию("ИспользоватьОтгрузкуБезПереходаПраваСобственности2_0") Тогда
				Элементы.ЭтапыГрафикаОплатыВариантОтсчета.СписокВыбора.Добавить(Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыПереходаПраваСобственности);
			КонецЕсли;
			
		Иначе
			Элементы.ЭтапыГрафикаОплатыВариантОплаты.СписокВыбора.Добавить(Перечисления.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления);
			Элементы.ЭтапыГрафикаОплатыВариантОплаты.СписокВыбора.Добавить(Перечисления.ВариантыКонтроляОплатыПоставщику.КредитСдвиг);
			Элементы.ЭтапыГрафикаОплатыВариантОплаты.СписокВыбора.Добавить(Перечисления.ВариантыКонтроляОплатыПоставщику.КредитПослеПоступления);
		КонецЕсли;
		
		РегулярныеПлатежи = Перечисления.ВариантыОпределенияГрафикаИсполненияВДоговоре.РегулярныеПлатежи;
		Если РеквизитыДоговора.ВариантОпределенияГрафикаИсполненияВДоговоре = РегулярныеПлатежи Тогда
			ТолькоПросмотр = Истина;
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Документ не поддерживает интерактивное изменение.'"));
		КонецЕсли;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);
	УстановитьЗаголовкиГрафикЧастичноИсполнен();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЭтапыГрафикаОплатыПроцентОплаты.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЭтапыГрафикаОплаты.ПроцентОплатыЗаполненНеВерно");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.FireBrick);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЭтапыГрафикаИсполненияДоговораПроцентИсполнения.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЭтапыГрафикаИсполненияДоговора.ПроцентИсполненияЗаполненНеВерно");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.FireBrick);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЭтапыГрафикаОплатыВариантОтсчета.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЭтапыГрафикаОплаты.ВариантОтсчета");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыЗаказа;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='от даты договора'"));
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЭтапыГрафикаОплатыСдвиг.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтапыГрафикаОплаты.ВариантОтсчета");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОтсчетаДатыПлатежа.ФиксированнаяДата;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.ДлительностьДоставки.Видимость = НЕ ЭтоРасчетыСКлиентами;
	
	Элементы.ЗаполнитьГрафикОплатыПоСоглашению.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") И ЭтоРасчетыСКлиентами
		ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСПоставщиками") И НЕ ЭтоРасчетыСКлиентами;
	
	Если ЭтоРасчетыСКлиентами Тогда
		
		Элементы.ЭтапыГрафикаИсполненияДоговораДатаПоГрафику.Видимость = Ложь;
		
	Иначе
		
		Элементы.ЭтапыГрафикаИсполненияДоговораДатаПоГрафику.Видимость = Объект.ДлительностьДоставки <> 0;
		
	КонецЕсли;
	
	РежимУчетаОтсрочки = ЗначениеЗаполнено(Объект.Календарь);
	Элементы.Календарь.Видимость = РежимУчетаОтсрочки;
	Элементы.ЭтапыГрафикаИсполненияДоговораУжеОтгружено.Видимость = Объект.ГрафикЧастичноИсполнен;
	Элементы.ЭтапыГрафикаОплатыУжеОплачено.Видимость = Объект.ГрафикЧастичноИсполнен;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтоговыеПоказатели(Форма)
	
	Форма.ПроцентОплатОбщий = 0;
	Форма.ПроцентИсполненияОбщий = 0;
	
	Для Каждого ТекСтрока Из Форма.Объект.ЭтапыГрафикаИсполненияДоговора Цикл
		
		Форма.ПроцентИсполненияОбщий = Форма.ПроцентИсполненияОбщий + ТекСтрока.ПроцентИсполнения;
		ТекСтрока.ПроцентИсполненияЗаполненНеверно = (Форма.ПроцентИсполненияОбщий > 100);
		Если Форма.ПроцентИсполненияОбщий = 100 Тогда
			Форма.НомерСтрокиПолногоИсполнения = ТекСтрока.НомерСтроки;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТекСтрока Из Форма.Объект.ЭтапыГрафикаОплаты Цикл
		
		Форма.ПроцентОплатОбщий = Форма.ПроцентОплатОбщий + ТекСтрока.ПроцентПлатежа;
		ТекСтрока.ПроцентОплатыЗаполненНеверно = (Форма.ПроцентОплатОбщий > 100);
		Если Форма.ПроцентОплатОбщий = 100 Тогда
			Форма.НомерСтрокиПолнойОплаты = ТекСтрока.НомерСтроки;
		КонецЕсли;
		
	КонецЦикла;
	
	Форма.НесколькоДатОтгрузки = Форма.Объект.ЭтапыГрафикаИсполненияДоговора.Количество() > 1;
	Форма.ДатаОтгрузки = ?(Форма.Объект.ЭтапыГрафикаИсполненияДоговора.Количество() = 1,Форма.Объект.ЭтапыГрафикаИсполненияДоговора[0].ДатаОтгрузки,Дата(1,1,1));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьПроценты(Форма)
	
	Если Форма.СуммаДоговора <> 0 Тогда
		
		ПроцентИсполнения = Окр(Форма.Объект.ЭтапыГрафикаИсполненияДоговора.Итог("СуммаИсполнения") * 100 / Форма.СуммаДоговора, 2);
		МассивЭтапов = Новый Массив();
		Для Каждого ЭтапГрафика Из Форма.Объект.ЭтапыГрафикаИсполненияДоговора Цикл 
			МассивЭтапов.Добавить(ЭтапГрафика.СуммаИсполнения);
		КонецЦикла; 
		Если МассивЭтапов.Количество() > 0 Тогда
			МассивПроцентов = ОбщегоНазначенияУТКлиентСервер.РаспределитьПропорционально(ПроцентИсполнения, МассивЭтапов);
			Для Счетчик = 0 По МассивЭтапов.Количество() - 1 Цикл 
				Если МассивПроцентов <> Неопределено Тогда
					Форма.Объект.ЭтапыГрафикаИсполненияДоговора[Счетчик].ПроцентИсполнения = МассивПроцентов[Счетчик];
				Иначе
					Форма.Объект.ЭтапыГрафикаИсполненияДоговора[Счетчик].ПроцентИсполнения = 0;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ПроцентОплаты = Окр(Форма.Объект.ЭтапыГрафикаОплаты.Итог("СуммаПлатежа") * 100 / Форма.СуммаДоговора, 2);
		МассивЭтапов.Очистить();
		Для Каждого ЭтапГрафика Из Форма.Объект.ЭтапыГрафикаОплаты Цикл 
			МассивЭтапов.Добавить(ЭтапГрафика.СуммаПлатежа);
		КонецЦикла; 
		Если МассивЭтапов.Количество() > 0 Тогда
			МассивПроцентов = ОбщегоНазначенияУТКлиентСервер.РаспределитьПропорционально(ПроцентОплаты, МассивЭтапов);
			Для Счетчик = 0 По МассивЭтапов.Количество() - 1 Цикл
				Если МассивПроцентов <> Неопределено Тогда
					Форма.Объект.ЭтапыГрафикаОплаты[Счетчик].ПроцентПлатежа = МассивПроцентов[Счетчик];
				Иначе
					Форма.Объект.ЭтапыГрафикаОплаты[Счетчик].ПроцентПлатежа = 0;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафикОплатыПоСоглашениюЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЗаполнитьГрафикОплатыПоСоглашениюНаСервере(Результат);
		Модифицированность = Истина;
	КонецЕсли;
	
	СортироватьЭтапыОплаты();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрафикОплатыПоСоглашениюНаСервере(Результат)
	
	ПараметрыЗаполненияЭтапов = ЭтапыОплатыСервер.ПараметрыЗаполненияЭтаповОплаты();
	ПараметрыЗаполненияЭтапов.НакладнаяПоЗаказам = Ложь;
	ПараметрыЗаполненияЭтапов.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
	ПараметрыЗаполненияЭтапов.ЭтоЗаказ = Истина;
	ПараметрыЗаполненияЭтапов.ДатаЗаказа = ДатаДоговора;
	ПараметрыЗаполненияЭтапов.ДатаОтгрузки = ДатаОтгрузки;
	ПараметрыЗаполненияЭтапов.Соглашение = Результат;
	ПараметрыЗаполненияЭтапов.СуммаОплаты = СуммаДоговора;
	ПараметрыЗаполненияЭтапов.ЭтоРасчетыСКлиентами = ЭтоРасчетыСКлиентами;
	
	ТаблицаОтгрузок = Объект.ЭтапыГрафикаИсполненияДоговора.Выгрузить();
	ТаблицаОтгрузок.Колонки.СуммаИсполнения.Имя = "СуммаПлатежа";
	ТаблицаОтгрузок.Колонки.Добавить("СуммаЗалогаЗаТару",ОбщегоНазначения.ОписаниеТипаЧисло(1));
	ПараметрыЗаполненияЭтапов.ТабличнаяЧасть = ТаблицаОтгрузок;
	
	ЭтапыОплатыСервер.ЗаполнитьЭтапыОплатыПоСоглашению(Объект.ЭтапыГрафикаОплаты, ПараметрыЗаполненияЭтапов);
	
	Объект.Календарь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат,"Календарь");
	
	Для Каждого Стр Из Объект.ЭтапыГрафикаОплаты Цикл
		Если Стр.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения Тогда
			Стр.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки;
		КонецЕсли;
		Если Стр.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.АвансДоПодтверждения Тогда
			Стр.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления;
		КонецЕсли;
		Если Стр.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыСогласования Тогда
			Стр.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыЗаказа;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьЭтапыОплаты()
	
	Для Каждого Стр Из Объект.ЭтапыГрафикаОплаты Цикл
		Стр.НомерВариантаОплаты = ?(Стр.ВариантОплаты = ПредопределенноеЗначение("Перечисление.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки")
									ИЛИ Стр.ВариантОплаты = ПредопределенноеЗначение("Перечисление.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления"),
									1,
									?(Стр.ВариантОплаты = ПредопределенноеЗначение("Перечисление.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения")
										ИЛИ Стр.ВариантОплаты = ПредопределенноеЗначение("Перечисление.ВариантыКонтроляОплатыПоставщику.АвансДоПодтверждения"),
										0,
										2));
	КонецЦикла;
	
	Объект.ЭтапыГрафикаОплаты.Сортировать("НомерВариантаОплаты, ДатаПлатежа");
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьЭтапыИсполнения()
	
	Объект.ЭтапыГрафикаИсполненияДоговора.Сортировать("ДатаПоГрафику");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроизводственныйКалендарьНаСервере()
	
	КалендарныеГрафики.ЗаполнитьПроизводственныйКалендарьВФорме(ЭтотОбъект, "Объект.Календарь");
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыРедактированияНесколькихЭтаповОплаты()
	
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Валюта",                         Валюта);
	СтруктураОткрытия.Вставить("ЭтоРасчетыСКлиентами",           ЭтоРасчетыСКлиентами);
	СтруктураОткрытия.Вставить("Календарь",                      Объект.Календарь);
	СтруктураОткрытия.Вставить("ДатаЗаказа",                     ДатаДоговора);
	СтруктураОткрытия.Вставить("ДатаСогласования",               Дата(1,1,1));
	СтруктураОткрытия.Вставить("СрокПереходаПраваСобственности", 0);
	СтруктураОткрытия.Вставить("ДатаПереходаПраваСобственности", Дата(1,1,1));
	СтруктураОткрытия.Вставить("СуммаОплатыПоДокументу",         СуммаДоговора);
	СтруктураОткрытия.Вставить("СуммаЗалогаПоДокументу",         0);
	СтруктураОткрытия.Вставить("ЭтоДоговор",                     Истина);
	СтруктураОткрытия.Вставить("ДатыОтгрузок",                   Объект.ЭтапыГрафикаИсполненияДоговора);
	СтруктураОткрытия.Вставить("ЭтапыГрафикаОплаты",             Объект.ЭтапыГрафикаОплаты);
	СтруктураОткрытия.Вставить("ЕстьТара",                       Ложь);
	
	Возврат СтруктураОткрытия;
	
КонецФункции

&НаСервере
Процедура СвернутьЭтапыИсполнения()
	Этапы = Объект.ЭтапыГрафикаИсполненияДоговора.Выгрузить();
	Этапы.Свернуть("ДатаПоГрафику,Комментарий,ДатаОтгрузки,УжеОтгружено","ПроцентИсполнения,СуммаИсполнения");
	Объект.ЭтапыГрафикаИсполненияДоговора.Загрузить(Этапы);
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаИсполненияДоговораПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		Объект.ЭтапыГрафикаОплаты.Очистить();
		Объект.ЭтапыГрафикаИсполненияДоговора.Удалить(Объект.ЭтапыГрафикаИсполненияДоговора.НайтиПоИдентификатору(ДополнительныеПараметры.СтрокаЭтапа));
		РассчитатьИтоговыеПоказатели(ЭтотОбъект);
		УстановитьВидимостьЭлементов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиГрафикЧастичноИсполнен()
	ЗаголовокФлага = НСтр("ru = 'График частично исполнен до начала ведения учета'");
	Если Объект.ГрафикЧастичноИсполнен Тогда
		СуммаОтгружено = 0;
		Для Каждого СтрокаЭтапа Из Объект.ЭтапыГрафикаИсполненияДоговора Цикл
			СуммаОтгружено = СуммаОтгружено + ?(СтрокаЭтапа.УжеОтгружено, СтрокаЭтапа.СуммаИсполнения, 0);
		КонецЦикла;
		СуммаОплачено = 0;
		Для Каждого СтрокаЭтапа Из Объект.ЭтапыГрафикаОплаты Цикл
			СуммаОплачено = СуммаОплачено + ?(СтрокаЭтапа.УжеОплачено, СтрокаЭтапа.СуммаПлатежа, 0);
		КонецЦикла;
		Если СуммаОтгружено = СуммаОплачено
			Или Объект.ЭтапыГрафикаИсполненияДоговора.Итог("СуммаИсполнения") <> СуммаДоговора
			Или Объект.ЭтапыГрафикаИсполненияДоговора.Итог("СуммаИсполнения") <> Объект.ЭтапыГрафикаОплаты.Итог("СуммаПлатежа") Тогда
			Элементы.ГрафикЧастичноИсполнен.Заголовок = ЗаголовокФлага;
			Элементы.ДекорацияГрафикЧастичноИсполнен.Видимость = Ложь;
		Иначе
			СостояниеВводаОстатков = СостояниеВводаОстатковРасчетовПоДоговору(Объект.Договор, СуммаОтгружено, СуммаОплачено);
			Элементы.ГрафикЧастичноИсполнен.Заголовок = ЗаголовокФлага + ":";
			Элементы.ДекорацияГрафикЧастичноИсполнен.Видимость = Истина;
			Элементы.ДекорацияГрафикЧастичноИсполнен.Заголовок = СостояниеВводаОстатков.ТекстПодсказки;
			Элементы.ДекорацияГрафикЧастичноИсполнен.ЦветТекста = СостояниеВводаОстатков.ЦветПодсказки;
		КонецЕсли;
	Иначе
		Элементы.ГрафикЧастичноИсполнен.Заголовок = ЗаголовокФлага;
		Элементы.ДекорацияГрафикЧастичноИсполнен.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СостояниеВводаОстатковРасчетовПоДоговору(СсылкаНаДоговор, СуммаОтгружено, СуммаОплачено)
	Результат = Новый Структура;
	Результат.Вставить("ЦветПодсказки", ЦветаСтиля.ЦветТекстаПроблема);
	Результат.Вставить("ТекстПодсказки", НСтр("ru = 'ввод остатков взаиморасчетов не соответствует графику'"));
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", СсылкаНаДоговор);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВводОстатковВзаиморасчетовРасчетыСПартнерами.Ссылка.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	СУММА(ВводОстатковВзаиморасчетовРасчетыСПартнерами.Сумма) КАК Сумма,
		|	ОбъектыРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	ОбъектыРасчетов.ТипРасчетов КАК ТипРасчетов
		|ИЗ
		|	 Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатковВзаиморасчетов.РасчетыСПартнерами КАК ВводОстатковВзаиморасчетовРасчетыСПартнерами
		|		ПО ВводОстатковВзаиморасчетовРасчетыСПартнерами.ОбъектРасчетовОтправитель = ОбъектыРасчетов.Ссылка
		|			И ВводОстатковВзаиморасчетовРасчетыСПартнерами.Ссылка.Проведен
		|ГДЕ
		|	ОбъектыРасчетов.Объект = &Объект
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводОстатковВзаиморасчетовРасчетыСПартнерами.Ссылка.ХозяйственнаяОперация,
		|	ОбъектыРасчетов.ВалютаВзаиморасчетов,
		|	ОбъектыРасчетов.ТипРасчетов";
	Выборка = Запрос.Выполнить().Выбрать();
	Если СуммаОплачено > СуммаОтгружено Тогда
		Если Выборка.Следующий()Тогда
			Если ЗначениеЗаполнено(Выборка.ХозяйственнаяОперация)
				И Выборка.Количество() = 1
				И (Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковАвансовКлиентов
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковАвансовПоставщикам)
				И Выборка.Сумма = СуммаОплачено - СуммаОтгружено Тогда
				Результат.ЦветПодсказки = Новый Цвет;
				Результат.ТекстПодсказки = НСтр("ru = 'ввод начальных остатков авансов соответствует графику'");
			ИначеЕсли Не ЗначениеЗаполнено(Выборка.ХозяйственнаяОперация) Тогда
				Если Выборка.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
					Результат.ТекстПодсказки = СтрШаблон(НСтр("ru = 'необходимо ввести остатки аванса клиента на сумму %1 %2'"),
					                                     Формат(СуммаОплачено - СуммаОтгружено, "ЧДЦ=2"),
					                                     Выборка.ВалютаВзаиморасчетов);
				Иначе
					Результат.ТекстПодсказки = СтрШаблон(НСтр("ru = 'необходимо ввести остатки аванса поставщику на сумму %1 %2'"),
					                                     Формат(СуммаОплачено - СуммаОтгружено, "ЧДЦ=2"),
					                                     Выборка.ВалютаВзаиморасчетов);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если Выборка.Следующий()Тогда
			Если ЗначениеЗаполнено(Выборка.ХозяйственнаяОперация)
				И Выборка.Количество() = 1
				И (Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковЗадолженностиКлиентов
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковЗадолженностиПоставщикам)
				И Выборка.Сумма = СуммаОтгружено - СуммаОплачено Тогда
				Результат.ЦветПодсказки = Новый Цвет;
				Результат.ТекстПодсказки = НСтр("ru = 'ввод начальных остатков задолженности соответствует графику'");
			ИначеЕсли Не ЗначениеЗаполнено(Выборка.ХозяйственнаяОперация) Тогда
				Если Выборка.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
					Результат.ТекстПодсказки = СтрШаблон(НСтр("ru = 'необходимо ввести остатки задолженности клиента на сумму %1 %2'"),
					                                     Формат(СуммаОтгружено - СуммаОплачено, "ЧДЦ=2"),
					                                     Выборка.ВалютаВзаиморасчетов);
				Иначе
					Результат.ТекстПодсказки = СтрШаблон(НСтр("ru = 'необходимо ввести остатки задолженности поставщику на сумму %1 %2'"),
					                                     Формат(СуммаОтгружено - СуммаОплачено, "ЧДЦ=2"),
					                                     Выборка.ВалютаВзаиморасчетов);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВТаблицеЭтаповЕстьЭтапыОтДатыОтгрузки()
	Возврат ЭтапыОплатыВызовСервера.ВТаблицеЭтаповЕстьЭтапыОтДатыОтгрузки(Объект.ЭтапыГрафикаОплаты);
КонецФункции

&НаСервере
Функция ДатаОтгрузкиПоУмолчанию(ВариантОтсчета, Формула)
	Если ЭтапыОплатыПовтИсп.СтрокаЭтаповЗависитОтДатыОтгрузки(ВариантОтсчета, Формула) Тогда
		Возврат ДатаОтгрузки;
	Иначе
		Возврат Дата(1,1,1);
	КонецЕсли;
КонецФункции

&НаСервере
Функция ДатаПоступленияПоКалендарю(ДатаОтгрузки, ВычисляемДатуОтгрузки = Ложь)
	Если ВычисляемДатуОтгрузки Тогда
		Возврат ЭтапыОплатыВызовСервера.ДатаПоКалендарю(Объект.Календарь,ДатаОтгрузки,-Объект.ДлительностьДоставки)
	Иначе
		Возврат ЭтапыОплатыВызовСервера.ДатаПоКалендарю(Объект.Календарь,ДатаОтгрузки,Объект.ДлительностьДоставки)
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПерезаполнитьДатыПоГрафикуИДатыПлатежа()
	
	Если Объект.ДлительностьДоставки <> 0 Тогда
		Для Каждого СтрокаИсполнения Из Объект.ЭтапыГрафикаИсполненияДоговора Цикл
			Если ЗначениеЗаполнено(Объект.Календарь) Тогда
				СтрокаИсполнения.ДатаПоГрафику = ДатаПоступленияПоКалендарю(СтрокаИсполнения.ДатаОтгрузки);
			Иначе
				СтрокаИсполнения.ДатаПоГрафику = СтрокаИсполнения.ДатаОтгрузки + 86400 * Объект.ДлительностьДоставки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого СтрокаОплаты Из Объект.ЭтапыГрафикаОплаты Цикл
		Если СтрокаОплаты.ВариантОтсчета = ПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.ОтДатыПоступления") Тогда
			СтруктураПараметров = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
			СтруктураПараметров.ДатаЗаказа                     = ДатаДоговора;
			СтруктураПараметров.ДатаСогласования               = ДатаДоговора;
			СтруктураПараметров.ДатаОтгрузки                   = СтрокаОплаты.ДатаОтгрузки;
			Если Объект.ДлительностьДоставки = 0 Тогда
				СтруктураПараметров.ДатаПоступления                = СтрокаОплаты.ДатаОтгрузки;
			ИначеЕсли ЗначениеЗаполнено(Объект.Календарь) Тогда
				СтруктураПараметров.ДатаПоступления                = ДатаПоступленияПоКалендарю(СтрокаОплаты.ДатаОтгрузки);
			Иначе
				СтруктураПараметров.ДатаПоступления                = СтрокаОплаты.ДатаОтгрузки + 86400 * Объект.ДлительностьДоставки;
			КонецЕсли;
			СтруктураПараметров.ДатаПереходаПраваСобственности = Дата(1,1,1);
			СтруктураПараметров.СрокПереходаПраваСобственности = Объект.ДлительностьДоставки;
			СтруктураПараметров.Календарь                      = Объект.Календарь;
			СтруктураПараметров.ВариантОтсчета                 = СтрокаОплаты.ВариантОтсчета;
			СтруктураПараметров.Формула                        = СтрокаОплаты.Формула;
			СтруктураПараметров.Сдвиг                          = СтрокаОплаты.Сдвиг;
			СтруктураПараметров.ДатаПлатежа                    = СтрокаОплаты.ДатаПлатежа;
			
			Если ЗначениеЗаполнено(СтруктураПараметров.Календарь) Тогда
				СтрокаОплаты.ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаПоКалендарю(СтруктураПараметров);
			Иначе
				СтрокаОплаты.ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаБезКалендаря(СтруктураПараметров);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура РежимУчетаОтсрочкиПриИзмененииСервер()
	Если РежимУчетаОтсрочки Тогда
		ЗаполнитьПроизводственныйКалендарьНаСервере()
	Иначе
		Объект.Календарь = ПредопределенноеЗначение("Справочник.ПроизводственныеКалендари.ПустаяСсылка");
	КонецЕсли;
	
	ПерезаполнитьДатыПоГрафикуИДатыПлатежа();
КонецПроцедуры

#КонецОбласти
